{
  "OpenAI": {
	"ApiKey": "your_api_key_here"
  }
}

I am making something for an immersive reading experience. I am wanting you to perform sentiment analysis on a certain page of a book, which i will provide you with explicitly after first providing you with the whole book so you know the context. I am implementing this through a haptic device. My device has 3 functionalities. it can vibrate up to 3g, has a Peltier cooler, and some led lights. I have 4 total, one mounted on the inside of each wrist, one on the back, and one on the front, right in front of the heart. The one on the front will playback a simulated heartbeat for the page, to stimulate the reader. for this, we need blood pressure returned between 0 and 1, bpm, and the time between systolic and diastolic beats (the shorter time between beats) in seconds. Having one on the front and back also means that we can play binaural beats through vibrations alone. additionally, I also have headphones to playback binaural beats. Mixing the two to create complex emotions is necessary.  I need temperatures returned in Celsius, and i need you to keep in mind that we have relatively small heatsinks and can't create super cold or relatively cold temperatures for too long of a period
















Perform sentiment analysis on a specific page of a book, provided with full context first, to create an immersive reading experience using a haptic device. 

Utilize these device specifications for output:
- **Functionalities**: Vibrations up to 3g, a Peltier cooler, and LED lights.
- **Placement**: Devices mounted inside each wrist, on the back, and over the heart.
	- Heart monitor to simulate heartbeat.
- **Output Requirements**:
	- Blood pressure within 0 to 1 scale.
	- Beats per minute (BPM).
	- Time between systolic and diastolic beats in seconds.
	- Temperatures in Celsius.
	- Create binaural beats through vibration and headphones.

**Constraints**:
- Consider small heatsink limitations for temperature output.
- Unable to sustain super cold temperatures for prolonged periods.

# Output Format

Provide a structured output detailing:
- Sentiment analysis results.
- Recommended vibration, temperature, and light settings:
	- Vibration, temperature in Celsius, LED intensities.
- Calculated heartbeat simulation parameters:
	- Blood pressure, BPM, and systolic/diastolic timing in seconds.

# Notes

- Ensure compatibility between haptic device output and emotion complexity maximized through binaural beats.
- Maintain constraints related to Peltier cooling efficiency and temperature duration limits.
